In [1]:
# Import Libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Set path
path = r"C:\Users\miche\Instacart Basket Analysis 2022_MP\02 Data"

# Methods for Combining Data

### Concatenating Data

In [3]:
# Define a dictionary containing January 2020 data
data1 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
    'purchased_meat':[0, 13, 3, 4],
    'purchased_alcohol':[1, 2, 10, 0],
    'purchased_snacks':[10, 5, 1, 7]}

# Define a dictionary containing February 2020 data
data2 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Feb-20', 'Feb-20', 'Feb-20', 'Feb-20'],
    'purchased_meat':[0, 10, 5, 3],
    'purchased_alcohol':[2, 4, 14, 0],
    'purchased_snacks':[15, 3, 2, 6]}

In [4]:
#Convert the dictionary into dataframe
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
df_1 = pd.DataFrame(data2,index=[0, 1, 2, 3])

In [5]:
df

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7

In [6]:
frames = [df, df_1]
df_concat = pd.concat(frames)

In [7]:
df_concat

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [8]:
# Create long form df
df_concat = pd.concat(frames, axis = 1)

### Appending Data

In [9]:
# Append the df
df_appended = df.append(df_1)

C:\Users\miche\AppData\Local\Temp\ipykernel_3516\2082798212.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_appended = df.append(df_1)

In [10]:
df_appended

  customer_id   month  purchased_meat  purchased_alcohol  purchased_snacks
0        6732  Jan-20               0                  1                10
1         767  Jan-20              13                  2                 5
2         890  Jan-20               3                 10                 1
3         635  Jan-20               4                  0                 7
0        6732  Feb-20               0                  2                15
1         767  Feb-20              10                  4                 3
2         890  Feb-20               5                 14                 2
3         635  Feb-20               3                  0                 6

In [11]:
#Append multiple dataframes:
# Create data with different columns from df
data3 = {'customer_id':['6732', '767', '890', '635'],
    'month':['Jan-20', 'Jan-20', 'Jan-20', 'Jan-20'],
    'days_purchased_on':[0, 13, 3, 4]}

# Convert to dataframe
df_2 = pd.DataFrame(data3,index=[0, 1, 2, 3])

In [12]:
df_append_test = df.append(df_2)

C:\Users\miche\AppData\Local\Temp\ipykernel_3516\2564146318.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df_append_test = df.append(df_2)

In [13]:
df_append_test

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on
0,6732,Jan-20,0.0,1.0,10.0,NaN
1,767,Jan-20,13.0,2.0,5.0,NaN
2,890,Jan-20,3.0,10.0,1.0,NaN
3,635,Jan-20,4.0,0.0,7.0,NaN
0,6732,Jan-20,NaN,NaN,NaN,0.0
1,767,Jan-20,NaN,NaN,NaN,13.0
2,890,Jan-20,NaN,NaN,NaN,3.0
3,635,Jan-20,NaN,NaN,NaN,4.0

### Merging Data

In [14]:
df_merged = df.merge(df_2, on = 'customer_id')

In [15]:
df_merged

,customer_id,month_x,purchased_meat,purchased_alcohol,purchased_snacks,month_y,days_purchased_on
0,6732,Jan-20,0,1,10,Jan-20,0
1,767,Jan-20,13,2,5,Jan-20,13
2,890,Jan-20,3,10,1,Jan-20,3
3,635,Jan-20,4,0,7,Jan-20,4

In [16]:
#Show results of merge - see _merge column
df_merged = df.merge(df_2, on = ['customer_id', 'month'], indicator = True)

In [17]:
df_merged

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,13,both
2,890,Jan-20,3,10,1,3,both
3,635,Jan-20,4,0,7,4,both

In [18]:
# Test merge without overwriting
pd.merge(df,df_2, on = ['customer_id', 'month'], indicator = True)

,customer_id,month,purchased_meat,purchased_alcohol,purchased_snacks,days_purchased_on,_merge
0,6732,Jan-20,0,1,10,0,both
1,767,Jan-20,13,2,5,13,both
2,890,Jan-20,3,10,1,3,both
3,635,Jan-20,4,0,7,4,both

In [19]:
# Delete unneccessary dataframes
del df_merged
del df_append_test
del df_2
del df
del df_1
del data1
del data2
del data3
del df_appended
del df_concat
del frames

# Merging Instacart Data

### In order to avoid memory errors the analyst will need to perform an 80/20 random split of the largest original  dataset, order_products_prior.csv before being merged with prepared data orders_clean. During each merge, the code will default to inner merge, only bringing matches into the final set as to not throw off the data.

In [3]:
# Import order_products_prior Original Dataset
prior = pd.read_csv(r"C:\Users\miche\Instacart Basket Analysis 2022_MP\02 Data\Original Data\order_products__prior.csv", index_col = False)

In [4]:
# Explore dataset
prior.shape

(32434489, 4)

In [5]:
prior.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [6]:
prior.columns

Index(['order_id', 'product_id', 'add_to_cart_order', 'reordered'], dtype='object')

In [7]:
prior.describe()

           order_id    product_id  add_to_cart_order     reordered
count  3.243449e+07  3.243449e+07       3.243449e+07  3.243449e+07
mean   1.710749e+06  2.557634e+04       8.351076e+00  5.896975e-01
std    9.873007e+05  1.409669e+04       7.126671e+00  4.918886e-01
min    2.000000e+00  1.000000e+00       1.000000e+00  0.000000e+00
25%    8.559430e+05  1.353000e+04       3.000000e+00  0.000000e+00
50%    1.711048e+06  2.525600e+04       6.000000e+00  1.000000e+00
75%    2.565514e+06  3.793500e+04       1.100000e+01  1.000000e+00
max    3.421083e+06  4.968800e+04       1.450000e+02  1.000000e+00

In [8]:
prior.dtypes

order_id             int64
product_id           int64
add_to_cart_order    int64
reordered            int64
dtype: object

In [9]:
prior.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32434489 entries, 0 to 32434488
Data columns (total 4 columns):
 #   Column             Dtype
---  ------             -----
 0   order_id           int64
 1   product_id         int64
 2   add_to_cart_order  int64
 3   reordered          int64
dtypes: int64(4)
memory usage: 989.8 MB

#### Data Wrangling complete, no changes made at this time.

In [16]:
# Check for mixed-type data
for col in prior.columns.tolist():
  weird = (prior[[col]].applymap(type) != prior[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (prior[weird]) > 0:
    print (col)

#### No output = no mixed data types

In [18]:
# Check for missing values
prior.isnull().sum()

order_id             0
product_id           0
add_to_cart_order    0
reordered            0
dtype: int64

In [19]:
# Check for duplicates
prior_dups=prior[prior.duplicated()]

In [20]:
prior_dups

Empty DataFrame
Columns: [order_id, product_id, add_to_cart_order, reordered]
Index: []

In [21]:
# Delete duplicate df, no duplicates
del prior_dups

#### Data Consistency Checks performed, no data changed.

## Creating 20% sample of df_prior, reducing it from > 34 million rows to > 6 million rows.

In [22]:
# Randomize rows, creating an 80/20 split
np.random.seed(4)
dev = np.random.rand(len(prior)) <= 0.8

In [23]:
dev

array([False,  True, False, ...,  True, False,  True])

In [24]:
# Create big and small dataframes
prior_80 = prior[dev]
prior_20 = prior[~dev]

In [25]:
prior_20.head()

    order_id  product_id  add_to_cart_order  reordered
0          2       33120                  1          1
2          2        9327                  3          0
6          2       40141                  7          1
12         3       21903                  4          1
13         3       17668                  5          1

In [26]:
prior_20.shape

(6487224, 4)

In [27]:
prior_80.shape

(25947265, 4)

In [29]:
# set path
path = r"C:\Users\miche\Instacart Basket Analysis 2022_MP\02 Data"

In [30]:
# Export big and small df, orders_80 and orders_20
prior_80.to_csv(os.path.join(path, 'Prepared Data', 'prior_80.csv'))

In [31]:
prior_20.to_csv(os.path.join(path, 'Prepared Data', 'prior_20.csv'))

In [32]:
# Delete big dataframe to avoid memory issues
del prior_80

## Data Analyst will continue working with a 20% random sample of orders_clean going forward.

In [44]:
# Import orders_clean.csv to merge with df_prior
orders = pd.read_csv(os.path.join(path, 'Prepared Data', 'orders_clean.csv'), index_col = False)

In [45]:
orders.shape

(3421083, 7)

In [46]:
# drop column
orders = orders.drop(columns = ['Unnamed: 0'])

In [47]:
orders.head()

   order_id  customer_id  order_number  order_day  order_hour  previous_order
0   2539329            1             1          2           8             NaN
1   2398795            1             2          3           7            15.0
2    473747            1             3          3          12            21.0
3   2254736            1             4          4           7            29.0
4    431534            1             5          4          15            28.0

In [48]:
prior_20.head()

    order_id  product_id  add_to_cart_order  reordered
0          2       33120                  1          1
2          2        9327                  3          0
6          2       40141                  7          1
12         3       21903                  4          1
13         3       17668                  5          1

In [49]:
# Merge the two dataframes on order_id
orders_merged = orders.merge(prior_20, on = 'order_id', indicator = True)

In [50]:
orders_merged.shape

(6487224, 10)

In [51]:
# Confirm merge
orders_merged.head()

,order_id,customer_id,order_number,order_day,order_hour,previous_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,26088,4,0,both
1,2398795,1,2,3,7,15.0,12427,3,1,both
2,473747,1,3,3,12,21.0,196,1,1,both
3,431534,1,5,4,15,28.0,196,1,1,both
4,3367565,1,6,2,7,19.0,12427,2,1,both

In [52]:
# Confirm merge match
orders_merged['_merge'].value_counts()

both          6487224
left_only           0
right_only          0
Name: _merge, dtype: int64

In [53]:
# Export data to pkl
orders_merged.to_pickle(os.path.join(path,'Prepared Data', 'orders_products_combined.pkl'))